app/views/scorecards/_total.html.erb

      <%= @scorecard.total = [@scorecard.hole_1.to_i, @scorecard.hole_2.to_i, @scorecard.hole_3.to_i, @scorecard.hole_4.to_i, @scorecard.hole_5.to_i, @scorecard.hole_6.to_i, @scorecard.hole_7.to_i, @scorecard.hole_8.to_i, @scorecard.hole_9.to_i, @scorecard.hole_10.to_i, @scorecard.hole_11.to_i, @scorecard.hole_12.to_i, @scorecard.hole_13.to_i, @scorecard.hole_14.to_i, @scorecard.hole_15.to_i, @scorecard.hole_16.to_i, @scorecard.hole_17.to_i, @scorecard.hole_18.to_i].inject(0) {|sum, x| sum + x} %>
      <% @scorecard.update_attributes(:total => @scorecard.total) %>
---
UPDATE "scorecards" SET "total" = ? WHERE "scorecards"."id" = ?  [["total", 72], ["id", 11]]