app/controllers/courses_controller.rb

  def index
    @courses = Course.paginate(:page => params[:page], per_page: 4)
---
SELECT  "courses".* FROM "courses" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "courses"

  def create
    @course = Course.new(course_params)
      respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "par_1", "par_2", "par_3", "par_4", "par_5", "par_6", "par_7", "par_8", "par_9", "par_10", "par_11", "par_12", "par_13", "par_14", "par_15", "par_16", "par_17", "par_18", "yardage_1", "yardage_2", "yardage_3", "yardage_4", "yardage_5", "yardage_6", "yardage_7", "yardage_8", "yardage_9", "yardage_10", "yardage_11", "yardage_12", "yardage_13", "yardage_14", "yardage_15", "yardage_16", "yardage_17", "yardage_18") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
		@course = Course.find(params[:id])
        if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "yardage_1" = ?, "yardage_2" = ?, "yardage_3" = ?, "yardage_4" = ?, "yardage_5" = ?, "yardage_6" = ?, "yardage_7" = ?, "yardage_8" = ?, "yardage_9" = ?, "yardage_10" = ?, "yardage_11" = ?, "yardage_12" = ?, "yardage_13" = ?, "yardage_14" = ?, "yardage_15" = ?, "yardage_16" = ?, "yardage_17" = ?, "yardage_18" = ? WHERE "courses"."id" = ?

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 4]]

  def edit
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]