app/controllers/players_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
     @player = Player.find(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("player_name", "created_at", "updated_at", "accomplishments") VALUES (?, ?, ?, ?)  [["player_name", "2nd in Major win "], ["created_at", "2017-08-18 14:28:43.942981"], ["updated_at", "2017-08-18 14:28:43.942981"], ["accomplishments", "Won 14 majors and 106 times world_wide"]]
---
  def create
    @player = Player.new(player_params)
      if @player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "player_name" = ?, "profile" = ?, "accomplishments" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["player_name", "Henrik Stenson"], ["profile", "Sweden  Great iron player"], ["accomplishments", "Won 2016 British Open"], ["updated_at", "2017-08-18 14:59:49.999412"], ["id", 6]]
---
  def update
    @player = Player.find(params[:id])
    if @player.update(player_params)

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 5]]
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy