app/controllers/scorecards_controller.rb

SELECT "scorecards".* FROM "scorecards" ORDER BY total desc
SELECT COUNT(*) FROM "scorecards"
---
  def index
      @scorecards = Scorecard.paginate(:page => params[:page],  per_page: 5)

SELECT  "scorecards".* FROM "scorecards" WHERE "scorecards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @scorecard = Scorecard.find(params[:id])

SELECT  "scorecards".* FROM "scorecards" WHERE "scorecards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @scorecard = Scorecard.find(params[:id])

INSERT INTO "scorecards" ("player", "hole_1", "hole_2", "hole_3", "hole_4", "hole_5", "hole_6", "hole_7", "hole_8", "hole_9") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["player", "ougouopiop"], ["hole_1", 7], ["hole_2", 97], ["hole_3", 97], ["hole_4", 97], ["hole_5", 97], ["hole_6", 979], ["hole_7", 79], ["hole_8", 7], ["hole_9", 9]]
---
  def create
    @scorecard = Scorecard.create(scorecard_params)

UPDATE "scorecards" SET "player" = ?, "hole_1" = ?, "hole_2" = ?, "hole_3" = ?, "hole_4" = ?, "hole_5" = ?, "hole_6" = ?, "hole_7" = ?, "hole_8" = ?, "hole_9" = ?, "hole_10" = ?, "hole_11" = ?, "hole_12" = ?, "hole_13" = ?, "hole_14" = ?, "hole_15" = ?, "hole_16" = ?, "hole_17" = ?, "hole_18" = ? WHERE "scorecards"."id" = ?
---
  def update
    if @scorecard.update(scorecard_params)

DELETE FROM "scorecards" WHERE "scorecards"."id" = ?  [["id", 2]]
---
  def destroy
    @scorecard.destroy

SELECT  "scorecards".* FROM "scorecards" WHERE "scorecards"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_scorecard
      @scorecard = Scorecard.find(params[:id])